Ping-Hsueh-Hsieh/stm32f446-dronecan-mc33772/Core/Src/afedrv/afedrv_common.h
/*
 * Copyright 2016 - 2020 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef COMMON_H_
#define COMMON_H_

#ifndef _GNU_SOURCE
#define _GNU_SOURCE
#include "stm32f4xx_hal.h"
#endif
#include "bcc.h"
#include "systimer.h"

/*******************************************************************************
 * Definitions (depends on the utilized HW setup)
 ******************************************************************************/

#define MC3377X_DEBUG 1

/* Used BCC device */
// #define MC33771C    /* Define MC33771C if FRDM33771CSPEVB or RD33771CDSTEVB is used. */
#define MC33772C    /* Define MC33772C if FRDM33772CSPEVB or KIT33772CTPLEVB is used. */

/* Used HW setup. */
#define MC3377X_USE_SPI         /* Define SPI if S32K144EVB + FRDM33771CSPEVB/FRDM33772CSPEVB is used. */
//#define MC3377X_USE_TPL         /* Define TPL if S32K144EVB + FRDMDUAL33664EVB + RD33771CDSTEVB/KIT33772CTPLEVB is used. */

/* Number of MC3377xC devices connected (must be 1U for SPI). */
#define BCC_DEMO_BCC_CNT        1U

/* R_SHUNT value in [uOhm].
 * RD33771CDSTEVB: Current measurement is not supported (ISENSE+ and ISENSE- are
 *                 grounded).
 * FRDM33771CSPEVB: ISENSE+ connected to X2-2, ISENSE- to X2-1. SHUNT resistor (R41)
                    is not populated on the board.
 * KIT33772CTPLEVB: ISENSE+ connected to J12-31, ISENSE- to J12-32. SHUNT resistor
                    is not populated on the board.
 * FRDM33772CSPEVB: ISENSE+ connected to J12-31, ISENSE- to J12-32. SHUNT resistor
                    is not populated on the board. */
#define SHUNT_UOHM             100000U

#if !defined(MC33771C) && !defined(MC33772C)
    #error "Select used BCC device by defining MC33771C or MC33772C."
#endif

#if defined(MC33771C) && defined(MC33772C)
    #error "Select only one type of BCC device."
#endif

#if !defined(MC3377X_USE_SPI) && !defined(MC3377X_USE_TPL)
    #error "Select used type of communication by defining SPI or TPL."
#endif

#if defined(MC3377X_USE_SPI) && defined(MC3377X_USE_TPL)
    #error "Select only one type of communication."
#endif

/*******************************************************************************
 * Initial register configuration
 ******************************************************************************/

/* Note: INIT register is initialized automatically by the BCC driver. */
/* Note: SYS_CFG_GLOBAL register contains only command GO2SLEEP (no initialization needed). */
/* Note: EEPROM_CTRL, FUSE_MIRROR_DATA and FUSE_MIRROR_CNTL registers are not initialized. */

/* Initial value of SYS_CFG1 register. */
#ifdef TPL
/* Disable current measurement for TPL board. */
#define MC33771C_SYS_CFG1_VALUE ( \
    MC33771C_SYS_CFG1_CYCLIC_TIMER(MC33771C_SYS_CFG1_CYCLIC_TIMER_DISABLED_ENUM_VAL) | \
    MC33771C_SYS_CFG1_DIAG_TIMEOUT(MC33771C_SYS_CFG1_DIAG_TIMEOUT_1S_ENUM_VAL) | \
    MC33771C_SYS_CFG1_I_MEAS_EN(MC33771C_SYS_CFG1_I_MEAS_EN_DISABLED_ENUM_VAL) | \
    MC33771C_SYS_CFG1_CB_DRVEN(MC33771C_SYS_CFG1_CB_DRVEN_DISABLED_ENUM_VAL) | \
    MC33771C_SYS_CFG1_GO2DIAG(MC33771C_SYS_CFG1_GO2DIAG_EXIT_ENUM_VAL) | \
    MC33771C_SYS_CFG1_CB_MANUAL_PAUSE(MC33771C_SYS_CFG1_CB_MANUAL_PAUSE_DISABLED_ENUM_VAL) | \
    MC33771C_SYS_CFG1_SOFT_RST(MC33771C_SYS_CFG1_SOFT_RST_DISABLED_ENUM_VAL) | \
    MC33771C_SYS_CFG1_FAULT_WAVE(MC33771C_SYS_CFG1_FAULT_WAVE_DISABLED_ENUM_VAL) | \
    MC33771C_SYS_CFG1_WAVE_DC_BITX(MC33771C_SYS_CFG1_WAVE_DC_BITX_500US_ENUM_VAL) \
)
#else

/* Enable current measurement for SPI board. */
#define MC33771C_SYS_CFG1_VALUE ( \
    MC33771C_SYS_CFG1_CYCLIC_TIMER(MC33771C_SYS_CFG1_CYCLIC_TIMER_DISABLED_ENUM_VAL) | \
    MC33771C_SYS_CFG1_DIAG_TIMEOUT(MC33771C_SYS_CFG1_DIAG_TIMEOUT_1S_ENUM_VAL) | \
    MC33771C_SYS_CFG1_I_MEAS_EN(MC33771C_SYS_CFG1_I_MEAS_EN_ENABLED_ENUM_VAL) | \
    MC33771C_SYS_CFG1_CB_DRVEN(MC33771C_SYS_CFG1_CB_DRVEN_DISABLED_ENUM_VAL) | \
    MC33771C_SYS_CFG1_GO2DIAG(MC33771C_SYS_CFG1_GO2DIAG_EXIT_ENUM_VAL) | \
    MC33771C_SYS_CFG1_CB_MANUAL_PAUSE(MC33771C_SYS_CFG1_CB_MANUAL_PAUSE_DISABLED_ENUM_VAL) | \
    MC33771C_SYS_CFG1_SOFT_RST(MC33771C_SYS_CFG1_SOFT_RST_DISABLED_ENUM_VAL) | \
    MC33771C_SYS_CFG1_FAULT_WAVE(MC33771C_SYS_CFG1_FAULT_WAVE_DISABLED_ENUM_VAL) | \
    MC33771C_SYS_CFG1_WAVE_DC_BITX(MC33771C_SYS_CFG1_WAVE_DC_BITX_500US_ENUM_VAL) \
)
#endif

/* Enable current measurement for MC33772C boards. */
#define MC33772C_SYS_CFG1_VALUE ( \
    MC33772C_SYS_CFG1_CYCLIC_TIMER(MC33772C_SYS_CFG1_CYCLIC_TIMER_DISABLED_ENUM_VAL) | \
    MC33772C_SYS_CFG1_DIAG_TIMEOUT(MC33772C_SYS_CFG1_DIAG_TIMEOUT_1S_ENUM_VAL) | \
    MC33772C_SYS_CFG1_I_MEAS_EN(MC33772C_SYS_CFG1_I_MEAS_EN_ENABLED_ENUM_VAL) | \
    MC33772C_SYS_CFG1_CB_DRVEN(MC33772C_SYS_CFG1_CB_DRVEN_DISABLED_ENUM_VAL) | \
    MC33772C_SYS_CFG1_GO2DIAG(MC33772C_SYS_CFG1_GO2DIAG_EXIT_ENUM_VAL) | \
    MC33772C_SYS_CFG1_CB_MANUAL_PAUSE(MC33772C_SYS_CFG1_CB_MANUAL_PAUSE_DISABLED_ENUM_VAL) | \
    MC33772C_SYS_CFG1_SOFT_RST(MC33772C_SYS_CFG1_SOFT_RST_DISABLED_ENUM_VAL) | \
    MC33772C_SYS_CFG1_FAULT_WAVE(MC33772C_SYS_CFG1_FAULT_WAVE_DISABLED_ENUM_VAL) | \
    MC33772C_SYS_CFG1_WAVE_DC_BITX(MC33772C_SYS_CFG1_WAVE_DC_BITX_500US_ENUM_VAL) \
)

#if MC3377X_DEBUG
#define MC33771C_SYS_CFG2_VALUE ( \
    MC33771C_SYS_CFG2_FLT_RST_CFG(MC33771C_SYS_CFG2_FLT_RST_CFG_RESET_DISABLED_ENUM_VAL) | \
    MC33771C_SYS_CFG2_TIMEOUT_COMM(MC33771C_SYS_CFG2_TIMEOUT_COMM_256MS_ENUM_VAL) | \
    MC33771C_SYS_CFG2_NUMB_ODD(MC33771C_SYS_CFG2_NUMB_ODD_EVEN_ENUM_VAL) | \
    MC33771C_SYS_CFG2_HAMM_ENCOD(MC33771C_SYS_CFG2_HAMM_ENCOD_DECODE_ENUM_VAL) \
)
#else
/* Initial value of SYS_CFG2 register. */
#define MC33771C_SYS_CFG2_VALUE ( \
    MC33771C_SYS_CFG2_FLT_RST_CFG(MC33771C_SYS_CFG2_FLT_RST_CFG_OSC_MON_RESET_ENUM_VAL) | \
    MC33771C_SYS_CFG2_TIMEOUT_COMM(MC33771C_SYS_CFG2_TIMEOUT_COMM_256MS_ENUM_VAL) | \
    MC33771C_SYS_CFG2_NUMB_ODD(MC33771C_SYS_CFG2_NUMB_ODD_EVEN_ENUM_VAL) | \
    MC33771C_SYS_CFG2_HAMM_ENCOD(MC33771C_SYS_CFG2_HAMM_ENCOD_DECODE_ENUM_VAL) \
)
#endif  // MC3377X_DEBUG

/* Initial value of ADC_CFG register. */
#define MC33771C_ADC_CFG_VALUE ( \
    MC33771C_ADC_CFG_AVG(MC33771C_ADC_CFG_AVG_NO_AVERAGING_ENUM_VAL) | \
    MC33771C_ADC_CFG_PGA_GAIN(MC33771C_ADC_CFG_PGA_GAIN_AUTO_ENUM_VAL) | \
    MC33771C_ADC_CFG_ADC1_A_DEF(MC33771C_ADC_CFG_ADC1_A_DEF_16_BIT_ENUM_VAL) | \
    MC33771C_ADC_CFG_ADC1_B_DEF(MC33771C_ADC_CFG_ADC1_B_DEF_16_BIT_ENUM_VAL) | \
    MC33771C_ADC_CFG_ADC2_DEF(MC33771C_ADC_CFG_ADC2_DEF_16_BIT_ENUM_VAL) \
)

