Ping-Hsueh-Hsieh/stm32f446-dronecan-mc33772/Core/Src/afedrv/afedrv_common.h
/* Initial value of ADC2_OFFSET_COMP register. */
#define MC33771C_ADC2_OFFSET_COMP_VALUE (\
    MC33771C_ADC2_OFFSET_COMP_CC_RST_CFG(MC33771C_ADC2_OFFSET_COMP_CC_RST_CFG_CC_RESET_ENUM_VAL) | \
    MC33771C_ADC2_OFFSET_COMP_FREE_CNT(MC33771C_ADC2_OFFSET_COMP_FREE_CNT_CLAMP_ENUM_VAL) | \
    MC33771C_ADC2_OFFSET_COMP_ALLCBOFFONSHORT(MC33771C_ADC2_OFFSET_COMP_ALLCBOFFONSHORT_SHORTED_ENUM_VAL) | \
    MC33771C_ADC2_OFFSET_COMP_ADC2_OFFSET_COMP(BCC_GET_ADC2_OFFSET(0)) \
)

/* Initial value of OV_UV_EN register. */
#define MC33771C_OV_UV_EN_VALUE ( \
    MC33771C_OV_UV_EN_COMMON_UV_TH(MC33771C_OV_UV_EN_COMMON_UV_TH_COMMON_ENUM_VAL) | \
    MC33771C_OV_UV_EN_COMMON_OV_TH(MC33771C_OV_UV_EN_COMMON_OV_TH_COMMON_ENUM_VAL) | \
    /* CTs OV and UV enable (bit is 1) or disable (bit is 0). */ \
    MC33771C_OV_UV_EN_CT14_OVUV_EN(MC33771C_OV_UV_EN_CT14_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33771C_OV_UV_EN_CT13_OVUV_EN(MC33771C_OV_UV_EN_CT13_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33771C_OV_UV_EN_CT12_OVUV_EN(MC33771C_OV_UV_EN_CT12_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33771C_OV_UV_EN_CT11_OVUV_EN(MC33771C_OV_UV_EN_CT11_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33771C_OV_UV_EN_CT10_OVUV_EN(MC33771C_OV_UV_EN_CT10_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33771C_OV_UV_EN_CT9_OVUV_EN(MC33771C_OV_UV_EN_CT9_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33771C_OV_UV_EN_CT8_OVUV_EN(MC33771C_OV_UV_EN_CT8_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33771C_OV_UV_EN_CT7_OVUV_EN(MC33771C_OV_UV_EN_CT7_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33771C_OV_UV_EN_CT6_OVUV_EN(MC33771C_OV_UV_EN_CT6_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33771C_OV_UV_EN_CT5_OVUV_EN(MC33771C_OV_UV_EN_CT5_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33771C_OV_UV_EN_CT4_OVUV_EN(MC33771C_OV_UV_EN_CT4_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33771C_OV_UV_EN_CT3_OVUV_EN(MC33771C_OV_UV_EN_CT3_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33771C_OV_UV_EN_CT2_OVUV_EN(MC33771C_OV_UV_EN_CT2_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33771C_OV_UV_EN_CT1_OVUV_EN(MC33771C_OV_UV_EN_CT1_OVUV_EN_ENABLED_ENUM_VAL) \
)

#define MC33772C_OV_UV_EN_VALUE ( \
    MC33772C_OV_UV_EN_COMMON_UV_TH(MC33772C_OV_UV_EN_COMMON_UV_TH_COMMON_ENUM_VAL) | \
    MC33772C_OV_UV_EN_COMMON_OV_TH(MC33772C_OV_UV_EN_COMMON_OV_TH_COMMON_ENUM_VAL) | \
    /* CTs OV and UV enable (bit is 1) or disable (bit is 0). */ \
    MC33772C_OV_UV_EN_CT6_OVUV_EN(MC33772C_OV_UV_EN_CT6_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33772C_OV_UV_EN_CT5_OVUV_EN(MC33772C_OV_UV_EN_CT5_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33772C_OV_UV_EN_CT4_OVUV_EN(MC33772C_OV_UV_EN_CT4_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33772C_OV_UV_EN_CT3_OVUV_EN(MC33772C_OV_UV_EN_CT3_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33772C_OV_UV_EN_CT2_OVUV_EN(MC33772C_OV_UV_EN_CT2_OVUV_EN_ENABLED_ENUM_VAL) | \
    MC33772C_OV_UV_EN_CT1_OVUV_EN(MC33772C_OV_UV_EN_CT1_OVUV_EN_ENABLED_ENUM_VAL) \
)

/* Initial value of CBx_CFG registers. */
#define MC33771C_CBX_CFG_VALUE ( \
    MC33771C_CB1_CFG_CB_EN(MC33771C_CB1_CFG_CB_EN_DISABLED_ENUM_VAL) | \
    MC33771C_CB1_CFG_CB_TIMER(0U) /* Cell balance timer in minutes. */ \
)

/* Initial value of GPIO_CFG1 register.
 * MC33771C EVBs expect NTC at all GPIOx pins.
 * MC33772C EVBs expect voltage measurement at GPIO5 and GPIO6. The rest of pins is
 *          supposed to be used for NTC.
 * Note: SPI EVBs no not use GPIO0 and GPIO2. */
#define MC33771C_GPIO_CFG1_VALUE ( \
    MC33771C_GPIO_CFG1_GPIO0_CFG(MC33771C_GPIO_CFG1_GPIO0_CFG_ANALOG_RATIO_ENUM_VAL) | \
    MC33771C_GPIO_CFG1_GPIO1_CFG(MC33771C_GPIO_CFG1_GPIO1_CFG_ANALOG_RATIO_ENUM_VAL) | \
    MC33771C_GPIO_CFG1_GPIO2_CFG(MC33771C_GPIO_CFG1_GPIO2_CFG_ANALOG_RATIO_ENUM_VAL) | \
    MC33771C_GPIO_CFG1_GPIO3_CFG(MC33771C_GPIO_CFG1_GPIO3_CFG_ANALOG_RATIO_ENUM_VAL) | \
    MC33771C_GPIO_CFG1_GPIO4_CFG(MC33771C_GPIO_CFG1_GPIO4_CFG_ANALOG_RATIO_ENUM_VAL) | \
    MC33771C_GPIO_CFG1_GPIO5_CFG(MC33771C_GPIO_CFG1_GPIO5_CFG_ANALOG_RATIO_ENUM_VAL) | \
    MC33771C_GPIO_CFG1_GPIO6_CFG(MC33771C_GPIO_CFG1_GPIO6_CFG_ANALOG_RATIO_ENUM_VAL) \
)

#define MC33772C_GPIO_CFG1_VALUE ( \
    MC33772C_GPIO_CFG1_GPIO0_CFG(MC33772C_GPIO_CFG1_GPIO0_CFG_ANALOG_RATIO_ENUM_VAL) | \
    MC33772C_GPIO_CFG1_GPIO1_CFG(MC33772C_GPIO_CFG1_GPIO1_CFG_ANALOG_RATIO_ENUM_VAL) | \
    MC33772C_GPIO_CFG1_GPIO2_CFG(MC33772C_GPIO_CFG1_GPIO2_CFG_ANALOG_RATIO_ENUM_VAL) | \
    MC33772C_GPIO_CFG1_GPIO3_CFG(MC33772C_GPIO_CFG1_GPIO3_CFG_ANALOG_RATIO_ENUM_VAL) | \
    MC33772C_GPIO_CFG1_GPIO4_CFG(MC33772C_GPIO_CFG1_GPIO4_CFG_ANALOG_RATIO_ENUM_VAL) | \
    MC33772C_GPIO_CFG1_GPIO5_CFG(MC33772C_GPIO_CFG1_GPIO5_CFG_ANALOG_ABS_ENUM_VAL) | \
    MC33772C_GPIO_CFG1_GPIO6_CFG(MC33772C_GPIO_CFG1_GPIO5_CFG_ANALOG_ABS_ENUM_VAL) \
)

/* Initial value of GPIO_CFG2 register. */
#define MC33771C_GPIO_CFG2_VALUE ( \
    MC33771C_GPIO_CFG2_GPIO2_SOC(MC33771C_GPIO_CFG2_GPIO2_SOC_ADC_TRG_DISABLED_ENUM_VAL) | \
    MC33771C_GPIO_CFG2_GPIO0_WU(MC33771C_GPIO_CFG2_GPIO0_WU_NO_WAKEUP_ENUM_VAL) | \
    MC33771C_GPIO_CFG2_GPIO0_FLT_ACT(MC33771C_GPIO_CFG2_GPIO0_FLT_ACT_DISABLED_ENUM_VAL) | \
    /* Note: GPIOx_DR are initialized to zero (low output level). */ \
    MC33771C_GPIO_CFG2_GPIO6_DR(MC33771C_GPIO_CFG2_GPIO6_DR_LOW_ENUM_VAL) | \
    MC33771C_GPIO_CFG2_GPIO5_DR(MC33771C_GPIO_CFG2_GPIO5_DR_LOW_ENUM_VAL) | \
    MC33771C_GPIO_CFG2_GPIO4_DR(MC33771C_GPIO_CFG2_GPIO4_DR_LOW_ENUM_VAL) | \
    MC33771C_GPIO_CFG2_GPIO3_DR(MC33771C_GPIO_CFG2_GPIO3_DR_LOW_ENUM_VAL) | \
    MC33771C_GPIO_CFG2_GPIO2_DR(MC33771C_GPIO_CFG2_GPIO2_DR_LOW_ENUM_VAL) | \
    MC33771C_GPIO_CFG2_GPIO1_DR(MC33771C_GPIO_CFG2_GPIO1_DR_LOW_ENUM_VAL) | \
    MC33771C_GPIO_CFG2_GPIO0_DR(MC33771C_GPIO_CFG2_GPIO0_DR_LOW_ENUM_VAL) \
)

/* Initial value of FAULT_MASK1 register. */
#define MC33771C_FAULT_MASK1_VALUE ( \
    MC33771C_FAULT_MASK1_VPWR_OV_FLT_MASK_12_F(MC33771C_FAULT_MASK1_VPWR_OV_FLT_MASK_12_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK1_VPWR_LV_FLT_MASK_11_F(MC33771C_FAULT_MASK1_VPWR_LV_FLT_MASK_11_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK1_COM_LOSS_FLT_MASK_10_F(MC33771C_FAULT_MASK1_COM_LOSS_FLT_MASK_10_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK1_COM_ERR_FLT_MASK_9_F(MC33771C_FAULT_MASK1_COM_ERR_FLT_MASK_9_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK1_CSB_WUP_FLT_MASK_8_F(MC33771C_FAULT_MASK1_CSB_WUP_FLT_MASK_8_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK1_GPIO0_WUP_FLT_MASK_7_F(MC33771C_FAULT_MASK1_GPIO0_WUP_FLT_MASK_7_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK1_I2C_ERR_FLT_MASK_6_F(MC33771C_FAULT_MASK1_I2C_ERR_FLT_MASK_6_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK1_IS_OL_FLT_MASK_5_F(MC33771C_FAULT_MASK1_IS_OL_FLT_MASK_5_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK1_IS_OC_FLT_MASK_4_F(MC33771C_FAULT_MASK1_IS_OC_FLT_MASK_4_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK1_AN_OT_FLT_MASK_3_F(MC33771C_FAULT_MASK1_AN_OT_FLT_MASK_3_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK1_AN_UT_FLT_MASK_2_F(MC33771C_FAULT_MASK1_AN_UT_FLT_MASK_2_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK1_CT_OV_FLT_MASK_1_F(MC33771C_FAULT_MASK1_CT_OV_FLT_MASK_1_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK1_CT_UV_FLT_MASK_0_F(MC33771C_FAULT_MASK1_CT_UV_FLT_MASK_0_F_NOT_MASKED_ENUM_VAL) \
)

/* Initial value of FAULT_MASK2 register. */
#define MC33771C_FAULT_MASK2_VALUE ( \
    MC33771C_FAULT_MASK2_VCOM_OV_FLT_MASK_15_F(MC33771C_FAULT_MASK2_VCOM_OV_FLT_MASK_15_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK2_VCOM_UV_FLT_MASK_14_F(MC33771C_FAULT_MASK2_VCOM_UV_FLT_MASK_14_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK2_VANA_OV_FLT_MASK_13_F(MC33771C_FAULT_MASK2_VANA_OV_FLT_MASK_13_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK2_VANA_UV_FLT_MASK_12_F(MC33771C_FAULT_MASK2_VANA_UV_FLT_MASK_12_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK2_ADC1_B_FLT_MASK_11_F(MC33771C_FAULT_MASK2_ADC1_B_FLT_MASK_11_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK2_ADC1_A_FLT_MASK_10_F(MC33771C_FAULT_MASK2_ADC1_A_FLT_MASK_10_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK2_GND_LOSS_FLT_MASK_9_F(MC33771C_FAULT_MASK2_GND_LOSS_FLT_MASK_9_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK2_AN_OPEN_FLT_MASK_6_F(MC33771C_FAULT_MASK2_AN_OPEN_FLT_MASK_6_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK2_GPIO_SHORT_FLT_MASK_5_F(MC33771C_FAULT_MASK2_GPIO_SHORT_FLT_MASK_5_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK2_CB_SHORT_FLT_MASK_4_F(MC33771C_FAULT_MASK2_CB_SHORT_FLT_MASK_4_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK2_CB_OPEN_FLT_MASK_3_F(MC33771C_FAULT_MASK2_CB_OPEN_FLT_MASK_3_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK2_OSC_ERR_FLT_MASK_2_F(MC33771C_FAULT_MASK2_OSC_ERR_FLT_MASK_2_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK2_DED_ERR_FLT_MASK_1_F(MC33771C_FAULT_MASK2_DED_ERR_FLT_MASK_1_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK2_FUSE_ERR_FLT_MASK_0_F(MC33771C_FAULT_MASK2_FUSE_ERR_FLT_MASK_0_F_NOT_MASKED_ENUM_VAL) \
)

