Ping-Hsueh-Hsieh/stm32f446-dronecan-mc33772/Core/Src/afedrv/afedrv_common.h
/* Initial value of FAULT_MASK3 register. */
#define MC33771C_FAULT_MASK3_VALUE ( \
    MC33771C_FAULT_MASK3_CC_OVR_FLT_MASK_15_F(MC33771C_FAULT_MASK3_CC_OVR_FLT_MASK_15_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK3_DIAG_TO_FLT_MASK_14_F(MC33771C_FAULT_MASK3_DIAG_TO_FLT_MASK_14_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK3_EOT_CB14_MASK_13_F(MC33771C_FAULT_MASK3_EOT_CB14_MASK_13_F_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK3_EOT_CB13_MASK_12_F(MC33771C_FAULT_MASK3_EOT_CB13_MASK_12_F_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK3_EOT_CB12_MASK_11_F(MC33771C_FAULT_MASK3_EOT_CB12_MASK_11_F_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK3_EOT_CB11_MASK_10_F(MC33771C_FAULT_MASK3_EOT_CB11_MASK_10_F_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK3_EOT_CB10_MASK_9_F(MC33771C_FAULT_MASK3_EOT_CB10_MASK_9_F_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK3_EOT_CB9_MASK_8_F(MC33771C_FAULT_MASK3_EOT_CB9_MASK_8_F_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK3_EOT_CB8_MASK_7_F(MC33771C_FAULT_MASK3_EOT_CB8_MASK_7_F_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK3_EOT_CB7_MASK_6_F(MC33771C_FAULT_MASK3_EOT_CB7_MASK_6_F_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK3_EOT_CB6_MASK_5_F(MC33771C_FAULT_MASK3_EOT_CB6_MASK_5_F_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK3_EOT_CB5_MASK_4_F(MC33771C_FAULT_MASK3_EOT_CB5_MASK_4_F_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK3_EOT_CB4_MASK_3_F(MC33771C_FAULT_MASK3_EOT_CB4_MASK_3_F_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK3_EOT_CB3_MASK_2_F(MC33771C_FAULT_MASK3_EOT_CB3_MASK_2_F_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK3_EOT_CB2_MASK_1_F(MC33771C_FAULT_MASK3_EOT_CB2_MASK_1_F_MASKED_ENUM_VAL) | \
    MC33771C_FAULT_MASK3_EOT_CB1_MASK_0_F(MC33771C_FAULT_MASK3_EOT_CB1_MASK_0_F_MASKED_ENUM_VAL) \
)

#define MC33772C_FAULT_MASK3_VALUE ( \
    MC33772C_FAULT_MASK3_CC_OVR_FLT_MASK_15_F(MC33772C_FAULT_MASK3_CC_OVR_FLT_MASK_15_F_NOT_MASKED_ENUM_VAL) | \
    MC33772C_FAULT_MASK3_DIAG_TO_FLT_MASK_14_F(MC33772C_FAULT_MASK3_DIAG_TO_FLT_MASK_14_F_NOT_MASKED_ENUM_VAL) | \
    MC33772C_FAULT_MASK3_VCP_UV_MASK_13_F(MC33772C_FAULT_MASK3_VCP_UV_MASK_13_F_NOT_MASKED_ENUM_VAL) | \
    MC33772C_FAULT_MASK3_EOT_CB6_MASK_5_F(MC33772C_FAULT_MASK3_EOT_CB6_MASK_5_F_MASKED_ENUM_VAL) | \
    MC33772C_FAULT_MASK3_EOT_CB5_MASK_4_F(MC33772C_FAULT_MASK3_EOT_CB5_MASK_4_F_MASKED_ENUM_VAL) | \
    MC33772C_FAULT_MASK3_EOT_CB4_MASK_3_F(MC33772C_FAULT_MASK3_EOT_CB4_MASK_3_F_MASKED_ENUM_VAL) | \
    MC33772C_FAULT_MASK3_EOT_CB3_MASK_2_F(MC33772C_FAULT_MASK3_EOT_CB3_MASK_2_F_MASKED_ENUM_VAL) | \
    MC33772C_FAULT_MASK3_EOT_CB2_MASK_1_F(MC33772C_FAULT_MASK3_EOT_CB2_MASK_1_F_MASKED_ENUM_VAL) | \
    MC33772C_FAULT_MASK3_EOT_CB1_MASK_0_F(MC33772C_FAULT_MASK3_EOT_CB1_MASK_0_F_MASKED_ENUM_VAL) \
)

/* Initial value of WAKEUP_MASK1 register. */
#define MC33771C_WAKEUP_MASK1_VALUE ( \
    MC33771C_WAKEUP_MASK1_VPWR_OV_FLT_MASK_12_F(MC33771C_WAKEUP_MASK1_VPWR_OV_FLT_MASK_12_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK1_VPWR_LV_FLT_MASK_11_F(MC33771C_WAKEUP_MASK1_VPWR_LV_FLT_MASK_11_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK1_GPIO0_WUP_FLT_MASK_7_F(MC33771C_WAKEUP_MASK1_GPIO0_WUP_FLT_MASK_7_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK1_IS_OC_FLT_MASK_4_F(MC33771C_WAKEUP_MASK1_IS_OC_FLT_MASK_4_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK1_AN_OT_FLT_MASK_3_F(MC33771C_WAKEUP_MASK1_AN_OT_FLT_MASK_3_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK1_AN_UT_FLT_MASK_2_F(MC33771C_WAKEUP_MASK1_AN_UT_FLT_MASK_2_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK1_CT_OV_FLT_MASK_1_F(MC33771C_WAKEUP_MASK1_CT_OV_FLT_MASK_1_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK1_CT_UV_FLT_MASK_0_F(MC33771C_WAKEUP_MASK1_CT_UV_FLT_MASK_0_F_NOT_MASKED_ENUM_VAL) \
)

/* Initial value of WAKEUP_MASK2 register. */
#define MC33771C_WAKEUP_MASK2_VALUE ( \
    MC33771C_WAKEUP_MASK2_VCOM_OV_FLT_MASK_15_F(MC33771C_WAKEUP_MASK2_VCOM_OV_FLT_MASK_15_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK2_VCOM_UV_FLT_MASK_14_F(MC33771C_WAKEUP_MASK2_VCOM_UV_FLT_MASK_14_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK2_VANA_OV_FLT_MASK_13_F(MC33771C_WAKEUP_MASK2_VANA_OV_FLT_MASK_13_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK2_VANA_UV_FLT_MASK_12_F(MC33771C_WAKEUP_MASK2_VANA_UV_FLT_MASK_12_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK2_ADC1_B_FLT_MASK_11_F(MC33771C_WAKEUP_MASK2_ADC1_B_FLT_MASK_11_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK2_ADC1_A_FLT_MASK_10_F(MC33771C_WAKEUP_MASK2_ADC1_A_FLT_MASK_10_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK2_GND_LOSS_FLT_MASK_9_F(MC33771C_WAKEUP_MASK2_GND_LOSS_FLT_MASK_9_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK2_IC_TSD_FLT_MASK_8_F(MC33771C_WAKEUP_MASK2_IC_TSD_FLT_MASK_8_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK2_GPIO_SHORT_FLT_MASK_5_F(MC33771C_WAKEUP_MASK2_GPIO_SHORT_FLT_MASK_5_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK2_CB_SHORT_FLT_MASK_4_F(MC33771C_WAKEUP_MASK2_CB_SHORT_FLT_MASK_4_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK2_OSC_ERR_FLT_MASK_2_F(MC33771C_WAKEUP_MASK2_OSC_ERR_FLT_MASK_2_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK2_DED_ERR_FLT_MASK_1_F(MC33771C_WAKEUP_MASK2_DED_ERR_FLT_MASK_1_F_NOT_MASKED_ENUM_VAL) \
)

/* Initial value of WAKEUP_MASK3 register. */
#define MC33771C_WAKEUP_MASK3_VALUE ( \
    MC33771C_WAKEUP_MASK3_CC_OVR_FLT_MASK_15_F(MC33771C_WAKEUP_MASK3_CC_OVR_FLT_MASK_15_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK3_EOT_CB14_MASK_13_F(MC33771C_WAKEUP_MASK3_EOT_CB14_MASK_13_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK3_EOT_CB13_MASK_12_F(MC33771C_WAKEUP_MASK3_EOT_CB13_MASK_12_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK3_EOT_CB12_MASK_11_F(MC33771C_WAKEUP_MASK3_EOT_CB12_MASK_11_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK3_EOT_CB11_MASK_10_F(MC33771C_WAKEUP_MASK3_EOT_CB11_MASK_10_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK3_EOT_CB10_MASK_9_F(MC33771C_WAKEUP_MASK3_EOT_CB10_MASK_9_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK3_EOT_CB9_MASK_8_F(MC33771C_WAKEUP_MASK3_EOT_CB9_MASK_8_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK3_EOT_CB8_MASK_7_F(MC33771C_WAKEUP_MASK3_EOT_CB8_MASK_7_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK3_EOT_CB7_MASK_6_F(MC33771C_WAKEUP_MASK3_EOT_CB7_MASK_6_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK3_EOT_CB6_MASK_5_F(MC33771C_WAKEUP_MASK3_EOT_CB6_MASK_5_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK3_EOT_CB5_MASK_4_F(MC33771C_WAKEUP_MASK3_EOT_CB5_MASK_4_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK3_EOT_CB4_MASK_3_F(MC33771C_WAKEUP_MASK3_EOT_CB4_MASK_3_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK3_EOT_CB3_MASK_2_F(MC33771C_WAKEUP_MASK3_EOT_CB3_MASK_2_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK3_EOT_CB2_MASK_1_F(MC33771C_WAKEUP_MASK3_EOT_CB2_MASK_1_F_NOT_MASKED_ENUM_VAL) | \
    MC33771C_WAKEUP_MASK3_EOT_CB1_MASK_0_F(MC33771C_WAKEUP_MASK3_EOT_CB1_MASK_0_F_NOT_MASKED_ENUM_VAL) \
)

#define MC33772C_WAKEUP_MASK3_VALUE ( \
    MC33772C_WAKEUP_MASK3_CC_OVR_FLT_MASK_15_F(MC33772C_WAKEUP_MASK3_CC_OVR_FLT_MASK_15_F_NOT_MASKED_ENUM_VAL) | \
    MC33772C_WAKEUP_MASK3_VCP_UV_MASK_13_F(MC33772C_WAKEUP_MASK3_VCP_UV_MASK_13_F_NOT_MASKED_ENUM_VAL) | \
    MC33772C_WAKEUP_MASK3_EOT_CB6_MASK_5_F(MC33772C_WAKEUP_MASK3_EOT_CB6_MASK_5_F_NOT_MASKED_ENUM_VAL) | \
    MC33772C_WAKEUP_MASK3_EOT_CB5_MASK_4_F(MC33772C_WAKEUP_MASK3_EOT_CB5_MASK_4_F_NOT_MASKED_ENUM_VAL) | \
    MC33772C_WAKEUP_MASK3_EOT_CB4_MASK_3_F(MC33772C_WAKEUP_MASK3_EOT_CB4_MASK_3_F_NOT_MASKED_ENUM_VAL) | \
    MC33772C_WAKEUP_MASK3_EOT_CB3_MASK_2_F(MC33772C_WAKEUP_MASK3_EOT_CB3_MASK_2_F_NOT_MASKED_ENUM_VAL) | \
    MC33772C_WAKEUP_MASK3_EOT_CB2_MASK_1_F(MC33772C_WAKEUP_MASK3_EOT_CB2_MASK_1_F_NOT_MASKED_ENUM_VAL) | \
    MC33772C_WAKEUP_MASK3_EOT_CB1_MASK_0_F(MC33772C_WAKEUP_MASK3_EOT_CB1_MASK_0_F_NOT_MASKED_ENUM_VAL) \
)

/* Initial value of TH_ALL_CT register. */
#define MC33771C_TH_ALL_CT_VALUE ( \
    MC33771C_TH_ALL_CT_ALL_CT_OV_TH(BCC_GET_TH_CTX(4200U))  /* CT OV threshold is 4200 mV. It is enabled/disabled through OV_UV_EN register. */ | \
    MC33771C_TH_ALL_CT_ALL_CT_UV_TH(BCC_GET_TH_CTX(2500U))  /* CT UV threshold is 2500 mV. It is enabled/disabled through OV_UV_EN register. */ \
)

/* Initial value of TH_CTx registers. */
#define MC33771C_TH_CTX_VALUE ( \
    MC33771C_TH_CT1_CT_OV_TH(BCC_GET_TH_CTX(4195U))  /* CT OV threshold is 4195 mV. It is enabled/disabled through OV_UV_EN register. */ | \
    MC33771C_TH_CT1_CT_UV_TH(BCC_GET_TH_CTX(2509U))  /* CT UV threshold is 2509 mV. It is enabled/disabled through OV_UV_EN register. */ \
)

