Ping-Hsueh-Hsieh/stm32f446-dronecan-mc33772/Core/Src/afedrv/afedrv_common.h
/* Initial value of TH_ANx_OT registers. */
#define MC33771C_TH_ANX_OT_VALUE ( \
    MC33771C_TH_AN1_OT_AN_OT_TH(BCC_GET_TH_ANX(1160U))  /* AN OT threshold is 1160 mV. It is enabled/disabled through FAULT_MASK1 register. */ \
)

/* Initial value of TH_ANx_UT registers. */
#define MC33771C_TH_ANX_UT_VALUE ( \
    MC33771C_TH_AN1_UT_AN_UT_TH(BCC_GET_TH_ANX(3820U))  /* AN UT threshold is 3820 mV. It is enabled/disabled through FAULT_MASK1 register. */ \
)

/* Initial value of TH_ISENSE_OC register. */
#define MC33771C_TH_ISENSE_OC_VALUE ( \
    MC33771C_TH_ISENSE_OC_TH_ISENSE_OC(BCC_GET_TH_ISENSE_OC(0U)) \
)

/* Initial value of TH_COULOMB_CNT_MSB register. */
#define MC33771C_TH_COULOMB_CNT_MSB_VALUE ( \
    MC33771C_TH_COULOMB_CNT_MSB_TH_COULOMB_CNT_MSB(BCC_GET_TH_COULOMB_CNT_MSB((uint32_t)0U)) \
)

/* Initial value of TH_COULOMB_CNT_LSB register. */
#define MC33771C_TH_COULOMB_CNT_LSB_VALUE ( \
    MC33771C_TH_COULOMB_CNT_LSB_TH_COULOMB_CNT_LSB(BCC_GET_TH_COULOMB_CNT_LSB((uint32_t)0U)) \
)

/* Number of BCC configuration registers set during the initialization. */
#define MC33771C_INIT_CONF_REG_CNT     59U
#define MC33772C_INIT_CONF_REG_CNT     43U

/*******************************************************************************
 * Structure definition
 ******************************************************************************/

/* Structure containing all data related to the Battery Cell Controller. */
typedef struct
{
    bcc_drv_config_t drvConfig;           /* BCC driver configuration. */
} bcc_data_t;

/* Structure containing a register name and its address. */
typedef struct
{
    const uint8_t address;
    const uint16_t defaultVal;
    const uint16_t value;
} bcc_init_reg_t;
/*******************************************************************************
 * Global variables
 ******************************************************************************/

extern bcc_data_t g_bccData;
extern const bcc_init_reg_t s_initRegsMc33771c[MC33771C_INIT_CONF_REG_CNT];
extern const bcc_init_reg_t s_initRegsMc33772c[MC33772C_INIT_CONF_REG_CNT];
extern SPI_HandleTypeDef hspi1;
extern DMA_HandleTypeDef hdma_spi1_rx;
extern DMA_HandleTypeDef hdma_spi1_tx;

/*******************************************************************************
 * API
 ******************************************************************************/
/*!
 * @brief This function tries to send NOP command to all CIDs.
 * No error is returned.
 */
void sendNops();

/*!
 * @brief This function prints content of registers configured in initialization
 * phase to serial console output.
 *
 * @param cid Cluster Identification Address.
 *
 * @return bcc_status_t Error code.
 */
bcc_status_t printInitialSettings(uint8_t cid);

/*!
 * @brief This function prints content of fault registers to serial console
 * output.
 *
 * @param cid Cluster Identification Address.
 *
 * @return bcc_status_t Error code.
 */
bcc_status_t printFaultRegisters(uint8_t cid);

#endif /* COMMON_H_ */
